/*
 * Medium
 *
 * 编写一种算法，若M × N矩阵中某个元素为0，则将其所在的行与列清零。
 *
 *
 *
 * 示例 1：
 *
 * 输入：
 * [
 *   [1,1,1],
 *   [1,0,1],
 *   [1,1,1]
 * ]
 * 输出：
 * [
 *   [1,0,1],
 *   [0,0,0],
 *   [1,0,1]
 * ]
 * 示例 2：
 *
 * 输入：
 * [
 *   [0,1,2,0],
 *   [3,4,5,2],
 *   [1,3,1,5]
 * ]
 * 输出：
 * [
 *   [0,0,0,0],
 *   [0,4,5,0],
 *   [0,3,1,0]
 * ]
 * 通过次数90,258
 * 提交次数140,596
 */

func setZeroes(M [][]int) {
	n, m := len(M), len(M[0])
	r0, c0 := false, false
	for i := 0; i < n; i++ {
		if M[i][0] == 0 {
			c0 = true
		}
	}
	for j := 0; j < m; j++ {
		if M[0][j] == 0 {
			r0 = true
		}
	}
	for i := 1; i < n; i++ {
		for j := 1; j < m; j++ {
			if M[i][j] == 0 {
				M[i][0], M[0][j] = 0, 0
			}
		}
	}
	for i := 1; i < n; i++ {
		if M[i][0] == 0 {
			for j := 1; j < m; j++ {
				M[i][j] = 0
			}
		}
	}
	for j := 1; j < m; j++ {
		if M[0][j] == 0 {
			for i := 1; i < n; i++ {
				M[i][j] = 0
			}
		}
	}
	if r0 {
		for j := 0; j < m; j++ {
			M[0][j] = 0
		}
	}
	if c0 {
		for i := 0; i < n; i++ {
			M[i][0] = 0
		}
	}
	return
}
